app/views/uploader/index.html.erb

SELECT `upload_files`.* FROM `upload_files`  ORDER BY `upload_files`.`id` DESC
---
      <th class="comment">コメント</th>
        <% UploadFile.all.reverse_order.each do |upload| %>