app/controllers/uploader_controller.rb

INSERT INTO "upload_files" ("name", "file", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["file", "docker.txt"], ["created_at", "2017-07-09 10:33:33.976598"], ["updated_at", "2017-07-09 10:33:33.976598"]]
---
  def upload
    @upload_file = UploadFile.new( params.require(:upload_file).permit(:name, :file, :comment) )
    @upload_file.save

SELECT  "upload_files".* FROM "upload_files" WHERE "upload_files"."id" = ? LIMIT 1  [["id", 1]]
---
  def download
    @upload_file = UploadFile.find(params[:id].to_i)